---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SteelElementFailures
source: html/3ad2a77c-c382-eac9-b9ea-85e95b562ae6.htm
---
# BuiltInFailures.SteelElementFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.